dev-space-server/app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
---
  def index
    articles = Article.all

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
      article = Article.find_by(id:params[:id])

INSERT INTO "articles" ("title", "topic_language", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
    def create
      article = Article.create(article_params)

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", " sequiowE;VM;EMV;WEMV; s."], ["updated_at", "2023-03-30 17:12:27.812935"], ["id", 2]]
---
    def update
      article = Article.find_by(id:params[:id])
      if article
        article.update(article_params)

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 48]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 27]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 3]]
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 16]]
---
    def destroy
      article = Article.find_by(id:params[:id])
      if article
        article.reviews.destroy_all # delete all associated reviews
        article.destroy