dev-space-server/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "shad@gmail.com"], ["LIMIT", 1]]
---
    def change

        user = User.find_by(email: params[:email])

INSERT INTO "users" ("username", "email", "password_digest", "bio", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
    def signup
        user = User.create!(prod_params)