dev-space-server/app/controllers/users_controller.rb

    def create
        user = User.create(user_params)
---
INSERT INTO "users" ("username", "email", "password_digest", "bio", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["username", "ryan"], ["email", "ryan@gmail.com"], ["password_digest", "[FILTERED]"], ["bio", nil], ["created_at", "2023-03-28 17:43:27.446466"], ["updated_at", "2023-03-28 17:43:27.446466"]]